# Missing Data

In [24]:
import numpy as np
import pandas as pd

In [25]:
data={
    'A':[1,2,np.nan,4,5],
    'B':[1,2,3,4,5],
    'C':[1,2,3,np.nan,np.nan],
    'D':[1,np.nan,np.nan,np.nan,5]
}
df=pd.DataFrame(data)
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [26]:
df.isna()

       A      B      C      D
0  False  False  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

In [27]:
df.isna().sum()

A    1
B    0
C    2
D    3
dtype: int64

In [28]:
df.isna().any()  #is there any column without null values

A     True
B    False
C     True
D     True
dtype: bool

### Removing  Null values

In [39]:
df.dropna()    #removes rows

     A  B    C    D
0  1.0  1  1.0  1.0

In [37]:
df.dropna(thresh=3)   #rows having minimum 3 non-null values

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
4  5.0  5  NaN  5.0

### Fill the missing data

In [40]:
# Fill with 0
df.fillna(0)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  0.0
2  0.0  3  3.0  0.0
3  4.0  4  0.0  0.0
4  5.0  5  0.0  5.0

In [42]:
# different values for different coulmns
values={'A':123,'B':990,'C':865,'D':90000}
df.fillna(value=values)

       A  B      C        D
0    1.0  1    1.0      1.0
1    2.0  2    2.0  90000.0
2  123.0  3    3.0  90000.0
3    4.0  4  865.0  90000.0
4    5.0  5  865.0      5.0

In [44]:
# filling with mean
df.fillna(df.mean())

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  3.0
2  3.0  3  3.0  3.0
3  4.0  4  2.0  3.0
4  5.0  5  2.0  5.0